app/controllers/score2s_controller.rb

SELECT  `training_classes`.* FROM `training_classes`  WHERE `training_classes`.`id` = 55 LIMIT 1
SELECT  `examinations`.* FROM `examinations`  WHERE `examinations`.`id` = 192 LIMIT 1
---
  def index
    #提供了培训班id,学员id,则 index 呈现 指定培训班下的/指定学员的/所有模考成绩
    if (params[:student_id] && params[:training_class_id])
      @student =Student.find(params[:student_id])
      @training_class =TrainingClass.find(params[:training_class_id])
      @examinations =@training_class.examinations
      @scores=@student.scores

      render 'index_with_all_examinations'

    elsif (params[:examination_id]) #指定了某次模考,则index 呈现关于此次模考所有有此模考成绩(所有学员的)
      @examination =Examination.find(params[:examination_id])

SELECT  `examinations`.* FROM `examinations`  WHERE `examinations`.`id` = 146 LIMIT 1
---
    def find_simulate_test
      @examination= Examination.find(params[:examination_id])

SELECT  `score2s`.* FROM `score2s`  WHERE `score2s`.`id` = 1118 LIMIT 1
---
    def set_simulate_test_score
      @score = Score2.find(params[:id])